app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("profile_name", "profile_first_name", "profile_second_name", "profile_phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["profile_name", ""], ["profile_first_name", ""], ["profile_second_name", ""], ["profile_phone", ""], ["created_at", "2018-06-12 10:23:31.758927"], ["updated_at", "2018-06-12 10:23:31.758927"]]
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "profile_name" = ?, "profile_first_name" = ?, "profile_second_name" = ?, "profile_phone" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["profile_name", "ds"], ["profile_first_name", "sdf"], ["profile_second_name", "sdf"], ["profile_phone", "sdf"], ["updated_at", "2018-06-12 10:23:39.138761"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)